software/jekyll-org-converter/index.html
---
title: Jekyll Org Plugin
date: 2017-01-15 19:50:44
layout: default
lang: ja
ref: software/jeykll-org-converter
permalink: /software/jeykll-org-converter/index.html
---
<div id="outline-container-orgac6a5e7" class="outline-2">
<h2 id="orgac6a5e7">これは何?</h2>
<div class="outline-text-2" id="text-orgac6a5e7">
<p>
Jekyll の原稿として <a href="http://orgmode.org/">Org mode</a> で書かれたファイルを処理できるようにするプラグインです．
</p>

<p>
org ファイルの <code>+OPTIONS</code> を Jekyll の YAML Front Matter として扱える様にしてありますので，
org ファイルに YAML Front Matter を書く必要はありません．
</p>

<p>
とはいえ原稿となる org ファイルには、最低限
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #b2b2b2;">    #+TITLE:</span>
<span style="color: #b2b2b2;">    #+DATE:</span>
<span style="color: #e5e5e6;">    #+LAYOUT:</span>
</pre>
</div>
<p>
を記載しておいて下さい．
</p>
</div>
</div>
<div id="outline-container-orgf70be2a" class="outline-2">
<h2 id="orgf70be2a">Depends</h2>
<div class="outline-text-2" id="text-orgf70be2a">
<ul class="org-ul">
<li>jekyll</li>
<li>org-ruby</li>
</ul>
</div>
</div>
<div id="outline-container-org8466d8d" class="outline-2">
<h2 id="org8466d8d">Usage</h2>
<div class="outline-text-2" id="text-org8466d8d">
<ul class="org-ul">
<li>Jekyll の <code>_plugin</code> に submodule としてでも放り込んで下さい。</li>
<li>org ファイルを html へ出力する際のタグのカスタマイズをしたい場合には、
<code>_html_tags.yml</code> を作成しておきます(リポジトリに example を置いてあります)。</li>
</ul>
</div>
</div>
<div id="outline-container-org2664e6c" class="outline-2">
<h2 id="org2664e6c">limitation</h2>
<div class="outline-text-2" id="text-org2664e6c">
<ul class="org-ul">
<li>Github Pages では許可された plugin しか使えませんので，本プラグインは使えません．</li>
</ul>
</div>
</div>
<div id="outline-container-orgb1a48da" class="outline-2">
<h2 id="orgb1a48da">License</h2>
<div class="outline-text-2" id="text-orgb1a48da">
<pre class="example">
  Permission is hereby granted, free of charge, to any person obtaining a
  copy of this software and associated documentation files (the "Software"),
  to deal in the Software without restriction, including without limitation
  the rights to use, copy, modify, merge, publish, distribute, sublicense,
  and/or sell copies of the Software, and to permit persons to whom the
  Software is furnished to do so, subject to the following conditions:
  .
  The above copyright notice and this permission notice shall be included
  in all copies or substantial portions of the Software.
  .
  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
  OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
  IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
  CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
  TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
  SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
</pre>
</div>
</div>
